using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ZOO
{
    class Giraffe : Animal
    {
        public override void Show()
        {
            //Console.WriteLine("ЖИРАФ");
            char[,] giraffe =
               {
                { '*', '*', '*', '*', '-', '*', '+', '*', '*', '*', '*', '*', '*','*','*' },
                { '*', '*', '*', '*', '-', '+', '+', '-', '*', '*', '*', '*', '*','*','*' },
                { '*', '+', '+', '+', '+', '-', '-', '-', '*', '*', '*', '*', '*','*','*' },
                { '+', '+', '+', '+', '/', '+', '+', '-', '*', '*', '*', '*', '*','*','*' },
                { '*', '+', '+', '+', '+', '+', '+', '-', '-', '*', '*', '*', '*','*','*' },
                { '*', '*', '*', '*', '-', '+', '+', '-', '-', '*', '*', '*', '*','*','*' },
                { '*', '*', '*', '*', '+', '+', '-', '-', '*', '*', '*', '*', '*','*','*' },
                { '*', '*', '*', '*', '+', '+', '+', '-', '-', '*', '*', '*', '*','*','*' },
                { '*', '*', '*', '*', '+', '+', '+', '-', '*', '*', '*', '*', '-','-','-' },
                { '*', '*', '*', '*', '+', '+', '+', '-', '*', '*', '*', '*', '-','*','*' },
                { '*', '*', '*', '*', '-', '+', '+', '-', '-', '+', '+', '+', '-','*','*' },
                { '*', '*', '*', '*', '+', '+', '+', '-', '+', '+', '+', '+', '+','*','*' },
                { '*', '*', '*', '*', '+', '-', '+', '*', '*', '*', '+', '+', '-','*','*' }
            };
            Print(giraffe);
        }
        public override void Eat()
        {
            Console.WriteLine("Жираф есть траву");
        }
        public override void Sleep()
        {
            Console.WriteLine("Жираф спит");
        }
        public override void Speak()
        {
            Console.WriteLine("Жираф смотрит в камеру");
        }
        public override void Walk()
        {
            Console.WriteLine("Жираф ходит по вольеру");
        }
        public override string ToString()
        {
            return "ЖИРАФ  ";
        }
    }
}
